In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [24]:
df1 = DataFrame({ 'col1': [10,10,15,10],
                    'col2': [10,25,25,10]
})
df1

   col1  col2
0    10    10
1    10    25
2    15    25
3    10    10

In [25]:
df1.duplicated()
#checks row wise

0    False
1    False
2    False
3     True
dtype: bool

In [26]:
df1.drop_duplicates()

   col1  col2
0    10    10
1    10    25
2    15    25

In [27]:
df1

   col1  col2
0    10    10
1    10    25
2    15    25
3    10    10

In [28]:
df1.drop_duplicates(['col1'])

   col1  col2
0    10    10
2    15    25

In [30]:
df1.drop_duplicates(['col1'], keep='last')

   col1  col2
2    15    25
3    10    10